WcfHarness/WcfHarness/RequestXmls/DeleteOrganization_SoftDelete.xml

<?xml version="1.0" encoding="utf-8" ?>
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteOrganization xmlns="http://www.tavisca.com/Vexiere/IOrganization/2013/01">
      <deleteOrgRequest xmlns:a="http://schemas.datacontract.org/2004/07/Tavisca.Vexiere.DataContract" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <a:AdditionalData i:nil="true"/>
        <a:IsHardDelete>false</a:IsHardDelete>
        <a:OrganizationIdentifier i:type="a:IdBasedOrganizationIdentifier">
          <a:Id>54</a:Id>
        </a:OrganizationIdentifier>
      </deleteOrgRequest>
    </DeleteOrganization>
  </s:Body>
</s:Envelope>
